# <font color="red"><h3 align="center">Pandas Merge Tutorial</h3></font>

In [30]:
import pandas as pd
#key와 value의 관계로 dictionary설정

df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
print(df1)

df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
print(df2)

df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35
       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [14]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [15]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [16]:
df3=pd.merge(df1,df2,on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [12]:
df4=pd.merge(df1,df2, on="city", how="inner")
df4

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### db의 join와 같다

In [18]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando","baltimore"],
    "temperature": [21,14,35,32],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [19]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [20]:
df4=pd.merge(df1,df2, on="city", how="outer")
df4

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35      75.0
3  baltimore           32       NaN

In [21]:
df4=pd.merge(df1,df2, on="city", how="inner")
df4

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [38]:
df5=pd.DataFrame({
    "city":['new york','chicago','california'],
    "population":['120','140','100']
})

In [39]:
df6=pd.merge(df1,df5,on="city",how="outer")

In [40]:
df6

         city  temperature population
0    new york         21.0        120
1     chicago         14.0        140
2     orlando         35.0        NaN
3  california          NaN        100

inner join은 intersection이고, outer join은 union이다

In [41]:
df6=pd.merge(df1,df5,on="city",how="left")
df6

       city  temperature population
0  new york           21        120
1   chicago           14        140
2   orlando           35        NaN

In [42]:
df6=pd.merge(df1,df5,on="city",how="right")
df6

         city  temperature population
0    new york         21.0        120
1     chicago         14.0        140
2  california          NaN        100

In [44]:
df1=pd.DataFrame({
    "name": ['angie','mike','dj','emily','anna'],
    "height": ['160','180','184','165','163']
})

In [45]:
df2=pd.DataFrame({
    "name": ['angie','mike','dj','zara','kate'],
    "height": ['160','180','184','162','155']
})

In [51]:
df3=pd.merge(df1,df2,on="name", how="outer", suffixes=['_left','_right'])
df3

    name height_left height_right
0  angie         160          160
1   mike         180          180
2     dj         184          184
3  emily         165          NaN
4   anna         163          NaN
5   zara         NaN          162
6   kate         NaN          155

In [52]:
df3=pd.merge(df1,df2,on="name", how="inner", suffixes=['_left','_right'])
df3

    name height_left height_right
0  angie         160          160
1   mike         180          180
2     dj         184          184